Revit 2027 API
CableType.CoreType Property
 The core type of the cable type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CoreType CoreType { get; set; }
Public Property CoreType As CoreType
	Get
	Set
public:
property CoreType CoreType {
	CoreType get ();
	void set (CoreType value);
}
member CoreType : CoreType with get, set
Property Value
CoreType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 It is single core by default.
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace